

# n -- 2 круассана, 1 эклер
# m -- 1 круассан, 2 эклера

# 2n + m = A
# n + 2m = B

# m + n = (A + B) / 3

# n = A - (A + B) / 3
# m = B - (A + B) / 3

  1 2 3 4
1 x x O x 
2 x x x x 
3 x x x F 
4 x x x x

  1 2 3 4 5 6
1 F x x x x x
2 x x F x x x
3 x x x x x x
4 x O x x x x
5 x x x x x x
6 O x x x x x

  1 2 3 4 5
1 x F x x x
2 x x x x x
3 x x x x x
4 O x x x x
5 x x x x x

# (x, y) -> (N + 1 - y, x)
(x, y) -> (y, N + 1 - x)
(4, 2) -> (2, 3) +
(6, 1) -> (1, 1) +
(4, 1) -> (1, 2) + 


1 -> 4 (5)
2 -> 3 (5)
3 -> 2 (5)
4 -> 1 (5)



1 2 3 4
  1 3 6 10


1 3 100
  1  4   100


2 2 2 3 4 5  7  20 20 23
ъ 2 4 6 9 13 18 25 45 65 88




2 2 2 3 9  15 15 48 99
  2 2 6 9  18 33 48 96 195 


                 (под каждой бактерией написан максимальный размер бактерий, полученных в ходе сражений ее и предыдущих)